TSD_TK/src/DataProcessors/Комплектовщик/Комплектовщик.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Комплектовщик</name>
  <tabularSections>
    <name>Документы</name>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеЕдиницы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодХарактеристики</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВведено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Весовой</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИспМРЦ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МРЦ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

TSD_TK/src/DataProcessors/Комплектовщик/Forms/АудитЯчеек/Module.bsl
#Область ОписаниеПеременных
&НаКлиенте
Перем ВыполняетсяЗакрытие;
#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

    Если Параметры.Свойство("АвтоТест") Тогда
        Возврат;
    КонецЕсли;
    ЗаполнитьДокумент(Отказ);
    ИнициализироватьКонстантыФормы();
    ОбновитьПодразделение();
    ОбновитьСотрудника();
    НастроитьФормуПоЗначениямНастроек();
КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ)
    ВыполняетсяЗакрытие = Ложь;
КонецПроцедуры
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, НастройкиЗакрытия)

    Если ВыполняетсяЗакрытие Тогда
        ОбщегоНазначенияКлиентСервер.ОчиститьСотрудника();
    Иначе
        ПоказатьВопрос(
			Новый ОписаниеОповещения("ВопросПослеЗакрытия", ЭтотОбъект), "Закрити документ?", РежимДиалогаВопрос.ДаНет,
            0, КодВозвратаДиалога.Да);

        Отказ = Истина; // Предотвращаем закрытие
    КонецЕсли;

КонецПроцедуры
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
    Если ПодключаемоеОборудованиеКлиент.ЭтоОповещениеСканераШтрихкода(ИмяСобытия) И ВводДоступен() Тогда

        ОбработатьПолученныйШтрихкод(Параметр, Новый Структура);

    ИначеЕсли ИмяСобытия = "ИзмененоПодразделение" Тогда

        ОбновитьПодразделение();

    ИначеЕсли ИмяСобытия = "ИзмененСотрудник" Тогда

        ОбновитьСотрудника();

    КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура СообщениеИнициализацииПользователяНажатие(Элемент)
    ОткрытьФорму("Обработка.Сервис.Форма.ИнициализацияСотрудник", , ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
    Отказ = Истина;
   //ОткрытьФормуВвода();
КонецПроцедуры
&НаКлиенте
Процедура ТоварыПередНачаломИзменения(Элемент, Отказ)
    Отказ = Истина;
    ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
    ОткрытьФормуВвода(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    СтандартнаяОбработка = Ложь;
    ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
    ОткрытьФормуВвода(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
    Отказ = Истина;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сканировать(Команда)
    ИдетПроцессСканирования = Истина;
    ОткрытьДиалогСканирования();
КонецПроцедуры
&НаКлиенте
Процедура АктивироватьСканер(Команда)
    ИнициализироватьАсинхронныйСканер();
КонецПроцедуры
&НаКлиенте
Процедура АудитЗавершение(Команда)
    Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);
    ПоказатьВопрос(Оповещение, "Ви впевнені, що хочете завершити аудит?", РежимДиалогаВопрос.ДаНет, 10,
        КодВозвратаДиалога.Нет, "Завершение аудита", КодВозвратаДиалога.Нет);
КонецПроцедуры
&НаКлиенте
Процедура ВзятьВРаботу(Команда)
    ВзялиВРаботу = ВзятьВРаботуНаСервере();
    Если Не ВзялиВРаботу Тогда
        ВыполняетсяЗакрытие = Истина;
        Закрыть();
    Иначе
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "ВзятьВРаботу", "Видимость", Ложь);
    КонецЕсли;

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, ДополнительныеПараметры) Экспорт
    Если Результат = КодВозвратаДиалога.Да Тогда
        ЗавершитьАудитНаКлиенте();
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьАудитНаКлиенте()
    Рез = ВыгрузитьДокументНаСервере();
    Если Рез.Результат Тогда
        ВыполняетсяЗакрытие = Истина;
        Закрыть();
    Иначе
        Если Не ПустаяСтрока(Рез.ОписаниеОшибки) Тогда
            ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Рез.ОписаниеОшибки);
        Иначе
            ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Помилка вивантаження документа!");
        КонецЕсли;
    КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ВыгрузитьДокументНаСервере()

    СтруктураДокумента = Новый Структура;
    СтруктураДокумента.Вставить("UUID_Сотрудник", ПараметрыСеанса.Сотрудник_ID);
    СтруктураДокумента.Вставить("ДокументUUID", ДокументUUID);
    МассивТовары = Новый Массив;
    Для Каждого Стр Из Товары Цикл
        СтруктураТовара = Новый Структура;
        СтруктураТовара.Вставить("ID_Строки", Стр.ID_Строки);
        СтруктураТовара.Вставить("КоличествоФактическое", Стр.КоличествоФактическое);
        СтруктураТовара.Вставить("МРЦ", Стр.МРЦ);
        СтруктураТовара.Вставить("КоличествоОжидаемое", Стр.КоличествоОжидаемое);
        СтруктураТовара.Вставить("СвободныйОстаток", Стр.СвободныйОстаток);
        СтруктураТовара.Вставить("КоличествоФактическое", Стр.КоличествоФактическое);
        МассивТовары.Добавить(СтруктураТовара);
    КонецЦикла;
    СтруктураДокумента.Вставить("Товары", МассивТовары);

    ТекстЗапроса = "/Complect/" + ПараметрыСеанса.UUID + "/DocAuditFinih";
    РезОтвет = КомплектовщикТК.ОтправитьНаСервер(СтруктураДокумента, ТекстЗапроса);

    Возврат РезОтвет;

КонецФункции

&НаКлиенте
Процедура ОткрытьФормуВвода(ТекДанные, КоличествоВвода = 0)

    ПараметрыСтроки = ПолучитьПараметрыСтроки(ТекДанные, КоличествоВвода);
    ТекИдентификаторСтроки =  ПараметрыСтроки.ИдентификаторСтроки;

    Если Не ПараметрыСтроки = Неопределено Тогда

        ДополнительныеПараметры = Новый Структура;
        ДополнительныеПараметры.Вставить("ИдентификаторСтроки", ПараметрыСтроки.ИдентификаторСтроки);

        ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеИзменитьСтроку", ЭтотОбъект, ДополнительныеПараметры);

        ОткрытьФорму("ОбщаяФорма.РедактированиеСтрокиV2", ПараметрыСтроки, ЭтотОбъект, , , , ОписаниеОповещения);

    КонецЕсли;

КонецПроцедуры
&НаКлиенте
Функция ПолучитьПараметрыСтроки(ТекущиеДанные, КоличествоВвода)

    Если ТекущиеДанные = Неопределено Тогда
        Возврат Неопределено;
    КонецЕсли;

    СтруктураПараметров = Новый Структура;

    СтруктураПараметров.Вставить("ИдентификаторСтроки", ТекущиеДанные.ПолучитьИдентификатор());
    СтруктураПараметров.Вставить("НомерСтроки", ТекущиеДанные.НомерСтроки);
    СтруктураПараметров.Вставить("НаименованиеТовара", ТекущиеДанные.НаименованиеТовара);
    СтруктураПараметров.Вставить("НаименованиеЕдиницы", ТекущиеДанные.НаименованиеЕдиницы);
    СтруктураПараметров.Вставить("Коэффициент", ТекущиеДанные.Коэффициент);
    СтруктураПараметров.Вставить("Остаток", ТекущиеДанные.СвободныйОстаток);
    СтруктураПараметров.Вставить("КоличествоВведено", ТекущиеДанные.КоличествоФактическое);
    СтруктураПараметров.Вставить("Коэффициент", ТекущиеДанные.Коэффициент);
    СтруктураПараметров.Вставить("Весовой", ТекущиеДанные.Весовой);
    СтруктураПараметров.Вставить("ПриемДо", ТекущиеДанные.ПриемДо);
    СтруктураПараметров.Вставить("МРЦ", ТекущиеДанные.МРЦ);
    СтруктураПараметров.Вставить("КоличествоВвода", КоличествоВвода);
    СтруктураПараметров.Вставить("АртикулТовара", ТекущиеДанные.Артикул);
    СтруктураПараметров.Вставить("Склад_ID", СкладUUID);
   // СтруктураПараметров.Вставить("ТаблицаШтрихКода", ТаблицаШтрихКода);
    СтруктураПараметров.Вставить("ТипДокумента", ПредопределенноеЗначение("Справочник.ТипыДокументов.АудитSKU"));
    Если ТекущиеДанные.МРЦ = 0 Тогда
        СтруктураПараметров.Вставить("ИспМРЦ", Ложь);
    Иначе
        СтруктураПараметров.Вставить("ИспМРЦ", Истина);
    КонецЕсли;
    ПоместитТаблицуШтрихкодовВоВременноеХранилище(СтруктураПараметров, ТекущиеДанные.Артикул);
    Возврат СтруктураПараметров;

КонецФункции

&НаСервере
Процедура ПоместитТаблицуШтрихкодовВоВременноеХранилище(СтруктураПараметров, Артикул)
    ТаблицаЗначенийШтрихкод = Новый ТаблицаЗначений;
    ТаблицаЗначенийШтрихкод.Колонки.Добавить("ШтрихКод", Новый ОписаниеТипов("Строка", ,
        Новый КвалификаторыСтроки(200)));
    ТаблицаЗначенийШтрихкод.Колонки.Добавить("Артикул", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(25)));
    ТаблицаЗначенийШтрихкод.Колонки.Добавить("Упаковка", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(15)));
    ТаблицаЗначенийШтрихкод.Колонки.Добавить("Коэффициент", Новый ОписаниеТипов("Число", , Новый КвалификаторыЧисла(10,
        3)));

    НайденыеСтроки = ТаблицаШтрихКода.НайтиСтроки(Новый Структура("Артикул", Артикул));

    Для Каждого СтрокаТаблицы Из НайденыеСтроки Цикл
        НоваяСтрока = ТаблицаЗначенийШтрихкод.Добавить();
        ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
    КонецЦикла;
    СтрокаАдресХранилища = ПоместитьВоВременноеХранилище(ТаблицаЗначенийШтрихкод, Новый УникальныйИдентификатор);
    СтруктураПараметров.Вставить("АдресТаблицыШтрихКода", СтрокаАдресХранилища);

КонецПроцедуры

&НаКлиенте
Процедура ОповещениеИзменитьСтроку(Результат, ДополнительныеПараметры) Экспорт

    Если Результат = Неопределено Или Результат = КодВозвратаДиалога.Отмена Тогда
        Возврат;
    КонецЕсли;
    ИдентификаторСтроки = ДополнительныеПараметры.ИдентификаторСтроки;
    СтрокаТаблицы = Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
    //
    Если Результат.Свойство("Сохранить") Тогда

        СтрокаТаблицы.КоличествоФактическое = Результат.КоличествоФактическое;
        СтрокаТаблицы.СвободныйОстаток = Результат.СвободныйОстаток;
        ОбновитьЗаписьПоСтроке(ИдентификаторСтроки);

        Модифицированность = Истина;

        ПодсветитьСтроку(ИдентификаторСтроки);
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодсветитьСтроку(ИдентификаторСтроки)
    СтрокаТоваров = Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
    Если Не СтрокаТоваров = Неопределено Тогда
        Элементы.Товары.ТекущаяСтрока = ТекИдентификаторСтроки;

        НомерСтрокиДляПодсветки = СтрокаТоваров.НомерСтроки;

        ПодключитьОбработчикОжидания("Подключаемый_ТекущаяСтрока", 1, Истина);

        ИнтервалСек = 2;
        ПодключитьОбработчикОжидания("Подключаемый_ОчиститьНомерСтрокиДляПодсветки", ИнтервалСек, Истина);
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОчиститьНомерСтрокиДляПодсветки()

    НомерСтрокиДляПодсветки = Неопределено;

КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ТекущаяСтрока()

    Элементы.Товары.ТекущаяСтрока = ТекИдентификаторСтроки;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокумент(Отказ)

    ДокументUUID = Параметры.ДокументUUID;

    ДанныеДокумента = ИнтеграцияТК_ВызовСервера.ПолучитьДанныеДокумента(Параметры);
    Если ДанныеДокумента.Результат Тогда
        СкладUUID = ДанныеДокумента.Ответ.SkladUUID;

        Счетчик = 0;

        Для Каждого СтрокаТЧ Из ДанныеДокумента.Ответ.Tovary Цикл
            Счетчик = Счетчик + 1;

            НоваяСтрока = Товары.Добавить();
            НоваяСтрока.НомерСтроки = Счетчик;
            НоваяСтрока.МестоХранения = СтрокаТЧ.Mh;
            НоваяСтрока.ID_Строки = строкаТЧ.ID_str;
            НоваяСтрока.Артикул = СтрокаТЧ.Art;
            НоваяСтрока.НаименованиеТовара = СтрокаТЧ.Tovar;
            НоваяСтрока.НаименованиеЕдиницы = СтрокаТЧ.EdIzm;
            НоваяСтрока.Коэффициент = СтрокаТЧ.Kof;
            НоваяСтрока.МРЦ = СтрокаТЧ.MRC;
            //НоваяСтрока.КоличествоФактическое = СтрокаТЧ.Fact;
            НоваяСтрока.Весовой = СтрокаТЧ.Ves;
            Если строкаТЧ.sht2 > 0 Тогда
                НоваяСтрока.ПриемДо = ТекущаяДатаСеанса() + (СтрокаТЧ.sht / 100) * СтрокаТЧ.sht2 * 86400 - 864000;
            Иначе
                НоваяСтрока.ПриемДо = ТекущаяДатаСеанса() + (СтрокаТЧ.sht / 3 * 2) * 86400 - 864000;
            КонецЕсли;

            НоваяСтрока.КоличествоОжидаемое = СтрокаТЧ.Ozd;
            НоваяСтрока.СвободныйОстаток = СтрокаТЧ.Ost;

            ОбновитьЗаписьПоСтроке( , НоваяСтрока);
        КонецЦикла;
            // ДанныеДокумента.Ответ.chk "chk,Art,Kof";            
        Для Каждого СтрокаТЧ Из ДанныеДокумента.Ответ.chk Цикл
            НоваяСтрока = ТаблицаШтрихКода.Добавить();
            НоваяСтрока.ШтрихКод = СтрокаТЧ.chk;
            НоваяСтрока.Артикул = СтрокаТЧ.Art;
            НоваяСтрока.Коэффициент = СтрокаТЧ.Kof;
        КонецЦикла;
    Иначе
        Отказ = Истина;
        Если Не ПустаяСтрока(ДанныеДокумента.ОписаниеОшибки) Тогда
            ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ДанныеДокумента.ОписаниеОшибки);
        Иначе
            ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Помилка отримання даних із сервера");
        КонецЕсли;
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаписьПоСтроке(ИдентификаторСтроки = Неопределено, Знач Строка = Неопределено)

    Если Не ИдентификаторСтроки = Неопределено Тогда
        СтрокаТовара = Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
    Иначе
        СтрокаТовара = Строка;
    КонецЕсли;
    Цвет = 0;
    Если СтрокаТовара.КоличествоФактическое = СтрокаТовара.СвободныйОстаток Тогда
        Цвет = 1;
    ИначеЕсли СтрокаТовара.КоличествоФактическое > 0 Тогда
        Цвет = 2;
    КонецЕсли;

    СтрокаТовара.Цвет = Цвет;

    ФорматКоличества = ?(СтрокаТовара.Весовой = 1, ЗначениеНастроекПовтИсп.ФорматВес(),
        ЗначениеНастроекПовтИсп.ФорматЦелоеЧисло());

    ЗаписьПоСтроке = "%МестоХранения% %сдп% ост. %СвободныйОстаток% факт %КоличествоФактическое% %НаименованиеЕдиницы% %МРЦ%";
    ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%СвободныйОстаток%", Формат(СтрокаТовара.СвободныйОстаток,
        ФорматКоличества));
    ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%КоличествоФактическое%", Формат(СтрокаТовара.КоличествоФактическое,
        ФорматКоличества));
    ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%НаименованиеЕдиницы%", Строка(СтрокаТовара.НаименованиеЕдиницы));
    ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%МРЦ%", ?(СтрокаТовара.МРЦ <> 0, " МРЦ - " + СтрокаТовара.МРЦ, ""));
    ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%сдп%", ?(ЗначениеЗаполнено(СтрокаТовара.ПриемДо), "ддп " + Формат(
        СтрокаТовара.ПриемДо, "ДФ=dd.MM.yyyy"), ""));
    ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%МестоХранения%", Строка(СтрокаТовара.МестоХранения));
    СтрокаТовара.ЗаписьПоСтроке = ЗаписьПоСтроке;

КонецПроцедуры
&НаКлиенте
Процедура ОткрытьДиалогСканирования()

    ДополнительныеПараметры = Новый Структура;
    ДополнительныеПараметры.Вставить("Форма", ЭтотОбъект);
    ДополнительныеПараметры.Вставить("ПотоковоеСканирование");
    ДополнительныеПараметры.Вставить("ЗаголовокСканирования", НСтр("ru = 'Считайте штрих-код'"));
    ДополнительныеПараметры.Вставить("ИмяОбработчикаЗакрытияСканирования", "ОбработкаЗакрытияСканирования");

    ПодключаемоеОборудованиеКлиент.ПолучитьШтрихкод(ДополнительныеПараметры);

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПолученныйШтрихкод(ПолученныйШтрихкод, Параметры) Экспорт

    Если ПустаяСтрока(ПолученныйШтрихкод) Тогда
        Возврат;
    КонецЕсли;
    Если Не ПользовательИнициализирован Тогда

        Результат	= ИнтеграцияТК_Клиент.ПолучитьСотрудника(ПолученныйШтрихкод);

        Если Результат.Результат Тогда
            Оповестить("ИзмененСотрудник");
        Иначе
            ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необхідна авторизація користувача");
        КонецЕсли;

        Возврат;
    КонецЕсли;
    Если Не ВРаботе Тогда
        Возврат;
    КонецЕсли;

    МассивСтрокШК = ТаблицаШтрихКода.НайтиСтроки(Новый Структура("ШтрихКод", ПолученныйШтрихкод));
    Если МассивСтрокШК.Количество() = 0 Тогда
        МассивСтрокАртикул = ТаблицаШтрихКода.НайтиСтроки(Новый Структура("Артикул", ПолученныйШтрихкод));
        Если МассивСтрокАртикул.Количество() = 0 Тогда
            ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не знайдено товару з таким штрихкодом або артикулом"
                + символы.ПС + ПолученныйШтрихкод);
        Иначе
            СтрокаШК = МассивСтрокАртикул[0];
        КонецЕсли;
    Иначе
        СтрокаШК = МассивСтрокШК[0];
    КонецЕсли;

    Артикул = строкаШК.Артикул;
    Коэффициент = строкаШК.Коэффициент;

    СтрокаТовара = Товары.НайтиСтроки(Новый Структура("Артикул", Артикул))[0];

    ОткрытьФормуВвода(СтрокаТовара, Коэффициент);

КонецПроцедуры
&НаКлиенте
Процедура ИнициализироватьАсинхронныйСканер()

    ПодключаемоеОборудованиеКлиент.ИнициализироватьАсинхронныйСканер(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
    ОбщегоНазначения.УстановитьШрифт(ЭтотОбъект);
    ОпределитьДоступностьКнопкиСканирования();

    НастроитьЭлементыАсинхронногоСканера();
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыАсинхронногоСканера()

    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "АктивироватьСканер", "Видимость",
        ИспользуетсяАсинхронныйСканер);

КонецПроцедуры

&НаКлиенте
Процедура ВопросПослеЗакрытия(Результат, ДополнительныеПараметры) Экспорт

    Если Результат = КодВозвратаДиалога.Да Тогда
        ВыполняетсяЗакрытие = Истина;
        Закрыть();
    КонецЕсли;

КонецПроцедуры
&НаСервере
Процедура ИнициализироватьКонстантыФормы()

    ИспользуетсяАсинхронныйСканер = ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяАсинхронныйСканерШтрихкодов();
    Инициализирован = Не ПустаяСтрока(ПараметрыСеанса.Подразделение);
    ПользовательИнициализирован = Не ПустаяСтрока(ПараметрыСеанса.Сотрудник);
КонецПроцедуры

&НаСервере
Процедура ОбновитьПодразделение()

    Если ПустаяСтрока(ПараметрыСеанса.Подразделение) Тогда
        Элементы.СообщениеИнициализации.Заголовок = "Пристрій не ініціалізований";
        ОбщегоНазначения.УстановитьЦветПолейОшибок(ЭтотОбъект, "СообщениеИнициализации");
        Инициализирован = Ложь;

    Иначе

        Элементы.СообщениеИнициализации.Заголовок = ПараметрыСеанса.Подразделение;
        ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(ЭтотОбъект, "СообщениеИнициализации");
        Инициализирован = Истина;

    КонецЕсли;

    ОпределитьДоступностьКнопкиСканирования();

КонецПроцедуры
&НаСервере
Процедура ОпределитьДоступностьКнопкиСканирования()

    ЕстьОборудованиеСканирования = ЗначениеЗаполнено(ЗначениеНастроекВызовСервераПовтИсп.ТипУстройстваСканирования());

    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "Сканировать", "Доступность",
        (ЕстьОборудованиеСканирования И Не ИспользуетсяАсинхронныйСканер) И Инициализирован
        И ПользовательИнициализирован);

КонецПроцедуры
&НаСервере
Процедура ОбновитьСотрудника()

    Если ПустаяСтрока(ПараметрыСеанса.Сотрудник) Тогда
        Элементы.СообщениеИнициализацииПользователя.Заголовок = "Користувач не ініціалізований";
        ОбщегоНазначения.УстановитьЦветПолейОшибок(ЭтотОбъект, "СообщениеИнициализацииПользователя");
        ПользовательИнициализирован = Ложь;
    Иначе
        Элементы.СообщениеИнициализацииПользователя.Заголовок = ПараметрыСеанса.Сотрудник;
        ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(ЭтотОбъект, "СообщениеИнициализацииПользователя");
        ПользовательИнициализирован = Истина;
    КонецЕсли;

    УстановитьДоступностьПоНастройкам();

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДопоплнительныеПараметры) Экспорт

    Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
        ВыполняетсяЗакрытие = Истина;
        Закрыть();
    КонецЕсли;
КонецПроцедуры
&НаСервере
Процедура УстановитьДоступностьПоНастройкам()

    ОпределитьДоступностьКнопкиСканирования();

    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "ГруппаАудит", "Видимость",
        ПользовательИнициализирован);
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "ГруппаТовары", "Видимость", ВРаботе); 
	 
//	Если ТипАудита = 1 Тогда
//		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "ГруппаТУ,ОчиститьТЕ", "Видимость", ПользовательИнициализирован);
//	ИначеЕсли ТипАудита = 2 Тогда 
//		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "ГруппаPKG", "Видимость", ПользовательИнициализирован);
//	КонецЕсли;
//	Если ТипАудита = 1 И ПользовательИнициализирован Тогда
//		ПолучитьДанныеПоЗапросамОчистки();
//	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ВзятьВРаботуНаСервере()

    ТекстЗапроса = "/Complect/" + ПараметрыСеанса.UUID + "/auditrab?uuidcom=" + ПараметрыСеанса.Сотрудник_ID
        + "&uuiddoc=" + ДокументUUID;
    ;
    РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(ТекстЗапроса);
    Если РезОтвет.Результат Тогда
        ВРаботе = Истина;
        УстановитьДоступностьПоНастройкам();
        ДатаНачалаАудита = ТекущаяДатаСеанса();
    Иначе
        Если Не ПустаяСтрока(РезОтвет.ОписаниеОшибки) Тогда
            ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезОтвет.ОписаниеОшибки);
        КонецЕсли;

    КонецЕсли;

    Возврат ВРаботе

КонецФункции

#КонецОбласти
